<?php

return [

    // общие сообщения
    'Your session has been expired or changed. Please re-enter.'                                   =>
        'Ваша сессия истекла. Перезайдите.',
    'You need to update the game. Actual version: %game_version%. Your version: %client_version%.' =>
        'Необходимо обновить игру. Актуальная версия: %game_version%. Ваша версия: %client_version%.',

    'Empty data sent.'                                                => 'Отправлены пустые данные.',
    'Incomplete data.'                                                => 'Неполный набор данных.',
    'Incorrect amount.'                                               => 'Неверное количество.',
    'Operation failed. Try again.'                                    => 'Ошибка операции. Попробуйте еще раз.',
    'Invalid CSRF-token.'                                             => 'Неверный CSRF-token.',

    //
    'Success'                                                         => 'Успешно',
    'Info'                                                            => 'Информация',
    'Error'                                                           => 'Ошибка',
    'Warning'                                                         => 'Внимание',

    //
    'Canceled.'                                                       => 'Отменен.',
    'In progress.'                                                    => 'Выполняется.',
    'Wait.'                                                           => 'Ожидание.',
    'Completed.'                                                      => 'Завершен.',
    'Unknown status.'                                                 => 'Неизвестный статус.',

    // числа
    'Too big number'                                                  => 'Слишком большое число',
    'Maximum value reached.'                                          => 'Достигнуто максимальное значение.',


    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    //      АВТОРИЗАЦИЯ, РЕГИСТРАЦИЯ, ВОССТАНОВЛЕНИЕ ПАРОЛЯ
    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————

    // пользователи
    'User not found.'                                                 => 'Пользователь не найден.',
    'Password'                                                        => 'Пароль',

    // статусы
    'Not confirm'                                                     => 'Не подтвержден',
    'Confirm'                                                         => 'Подтвержден',
    'Admin'                                                           => 'Админ',

    // авторизация
    'Wrong E-mail / login or password.'                               => 'Неверные E-mail / Логин или пароль.',
    'Account not verified. Check E-mail.'                             => 'Учетная запись не подтверждена. Проверьте E-mail.',
    'E-mail or username'                                              => 'Email или логин',
    'Remember Me'                                                     => 'Запомнить',
    'Sign In'                                                         => 'Войти',

    // пароль
    'Password must be of minimum %length% characters length.'         => 'Минимальная длина пароля %length% символов.',
    'Password mismatch.'                                              => 'Пароли не совпадают.',

    // регистрация
    'Username or E-mail aren\'t be empty.'                            => 'Логин или E-mail не указаны.',
    'User with this Username already exists.'                         => 'Пользователь с таким логин уже существует.',
    'User with this E-mail already exists.'                           => 'Пользователь с таким E-mail уже существует.',
    'Referral not found.'                                             => 'Реферал не найден.',
    'Confirmation of registration.'                                   => 'Подтверждение регистрации.',
    'We have sent you a letter. Check your email.'                    => 'Вам было отправлено письмо. Проверьте почту.',
    'Congratulations, you have successfully registered!'              => 'Поздравляем, Вы успешно зарегистрировались!',
    'Sign Up'                                                         => 'Зарегистрироваться',

    // восстановление пароля
    'Password reset.'                                                 => 'Восстановление пароля.',
    'We have already sent you a password reset instruction by email.' =>
        'Вам уже отправлено письмо с инструкцией по восстановлению.',


    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    //      СТРАНИЦЫ ОШИБОК
    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————

    // Page 404 error
    'Oops! Page not found.'                                           => 'Упс! Страница не найдена',
    'We could not find the page you were looking for.<br />Meanwhile, you may <a href="%link%">return to home page</a>.'
                                                                      =>
        'Страница не найдена.<br />Вы можете <a href="%link%">вернуться на главную страницу</a>.',

    // Page 500 error
    'Oops! Something went wrong.'                                     => 'Упс! Что-то пошло не так.',
    'We will work on fixing that right away.'                         => 'Мы уже решаем проблему.',


    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    //      СУЩНОСТИ
    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————

    '%name% can\'t be empty' => '%name% не может быть пустым',

    'Incorrect E-mail'                             => 'Неверный формат E-mail',
    'Empty Username sent.'                         => 'Отправлен пустой логин.',
    'Slug'                                         => 'URL ярлык',
    'Name'                                         => 'Имя',


    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    //      СЕРВИСЫ
    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————

    // отправка E-mail
    'E-mail not specified to send email.'          => 'Не указан E-mail для отправки письма.',
    'Server error. Failed to send mail to %email%' => 'Ошибка сервера. Не удалось отправить письмо на %email%',
    'Failed to send Email. Contact to support.'    => 'Не удалось отправить E-mail. Обратитесь в поддержку.',


    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    //      ТОКЕНЫ
    // ————————————————————————————————————————————————————————————————————————————————————————————————————————————————

    'Incorrect code.'  => 'Неверный код.',
    'Incorrect token.' => 'Неверный токен.',

];
